cppnow/convert-state-machine-coroutine-slides.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:nil \n:nil ^:nil arch:headline author:nil
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:nil e:t
#+OPTIONS: email:nil f:t inline:t num:nil p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:nil title:t toc:nil todo:t |:t
#+TITLE:
#+AUTHOR:
#+EMAIL:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_COMPILER: pdflatex
#+DATE:
#+STARTUP: showall
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+OPTIONS: reveal_width:1600 reveal_height:900
#+REVEAL_THEME: black
#+REVEAL_TRANS: fade
#+REVEAL_MATHJAX_URL: https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://sdowney.org/css/smd-zenburn.css" />
#+REVEAL_EXTRA_CSS: http://sdowney.org/css/smd-zenburn.css
#+REVEAL_TITLE_SLIDE_BACKGROUND: http://sdowney.org/images/StateMachineTitle.png

#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_VERSION: 4

* Abstract
  C++ 20 coroutines can naturally express in linear code components that are today written as state machines that wait on async operations. This talk walks through using the low-level machinery and customization points in C++ 20 to convert a state machine, which waits at the end of steps for async service operations to complete, into a single coroutine that `co_awaits` those operations.

* Super brief and inaccurate summary of C++20 Coroutines

#+ATTR_REVEAL: :frag (appear)
  - Whatever you think they are?
  - It's probably less than that.

*** Like a lambda
    Except
#+ATTR_REVEAL: :frag (appear)
    - The lambda is the return type
    - They control when they suspend
    - No stacks, threads, or fibers
**** Stackful vs Stackless
#+ATTR_REVEAL: :frag (appear)
     - "Stackless"
     - Which means they execute on the regular stack.
     - The architectural model is very different.
     - If you don't know these terms - forget they exist.
     - Coroutine == Resumable Stateful Function

***  If it co_awaits it's a coroutine
#+ATTR_REVEAL: :frag (appear)
    - ~co_await~
    - ~co_yield~
      * is a co_await
    - ~co_return~
      * is a very special co_await †
*** A Coroutine's body
    #+begin_src c++
{
   promise-type promise{promise-constructor-arguments};
   try {
      co_await promise.initial_suspend() ;
      function-body
   } catch ( ... ) {
      if (!initial-await-resume-called)
         throw ;
      promise.unhandled_exception() ;
   }
final-suspend :
   co_await promise.final_suspend() ;
}
    #+end_src
- promise-type :: determined by coroutine_traits<>, but usually a typedef in the return type.
- promise-constructor-arguments :: the parameters if there's a valid overload for promise-type that takes them, otherwise empty.
- function-body :: the body of the coroutine function.
- initial-await-resume-called :: was the await_resume of the initial suspend called. Did we start.
- final-suspend :: † target for ~co_return~ which calls either ~return_value~ or ~return_void~ first then executes ~goto final-suspend~.
*** Awaitable and Promise
**** Awaitables are easy:
    - bool await_ready() :: proceed or suspend - false is suspend
    - await_suspend :: called if await_ready is (contextually) false
      * void await_suspend(coroutine_handle<> h) :: call await_suspend and suspend
      * bool await_suspend(coroutine_handle<> h) :: call await_suspend and resume if false
      * std​::​coroutine_handle<Z> await_suspend(coroutine_handle<> h) :: call resume() on return
    - T await_resume() :: call when resume, T is the result of co_await

      Awaitable interface is programmer facing.
**** Minimal Example
     #+begin_src c++
template <typename T>
struct awaitable : public std::suspend_always {
    // constexpr bool await_ready() const noexcept { return false; } // from std::suspend always
    constexpr void await_suspend(coroutine_handle<> h) const noexcept { h.resume(); }
    constexpr T await_resume() const noexcept { return T{}; }
};
     #+end_src
**** Promises are a little harder:
    - ReturnType::promise_type :: typedef for the promise
    - get_return_object() :: the return type of the coroutine
    - return_
      * return_value() :: return value or ...
      * return_void() :: return void
    - initial_suspend() :: initial suspend before body
    - final_suspend() :: final suspend after body
    - unhandled_exception() :: called if an exception escapes
      Promises and coro return types are library writer facing.
*** GCC's implementation is almost exactly lambda
    There's an instance of an unnamable type that is tied to the particular coroutine frame. The type has a bit of state that indicates where the `jmp` to upon entry goes to. The coroutine function allocates one of these, and ties it to the return type via the promise.
