cppnow/convert-state-machine-coroutine-slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<meta name="description" content="
"/>
<meta name="keywords" content=" "/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/black.css" id="theme"/>

<link rel="stylesheet" href="http://sdowney.org/css/smd-zenburn.css"/>

<link rel="stylesheet" href="./footer.css"/>

<link rel="stylesheet" type="text/css" href="http://sdowney.org/css/smd-zenburn.css" />
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="http://sdowney.org/images/StateMachineTitle.png">

</section>

<section>
<section id="slide-orgf56de85">
<h2 id="orgf56de85">Converting a State Machine to a C++ 20 Coroutine</h2>
<p>
Steve Downey
</p>

<p>
© 2021 Bloomberg Finance L.P. All rights reserved.
</p>

</section>
</section>
<section>
<section id="slide-orgbfa83ed">
<h2 id="orgbfa83ed">Abstract</h2>
<p>
C++ 20 coroutines can naturally express in linear code components that are today written as state machines that wait on async operations.
</p>

<p>
This talk walks through using the low-level machinery and customization points in C++ 20 to convert a state machine, which waits at the end of steps for async service operations to complete, into a single coroutine that `co_awaits` those operations.
</p>

</section>
</section>
<section>
<section id="slide-org1674966">
<h2 id="org1674966">Super brief and inaccurate summary of C++20 Coroutines</h2>
<ul>
<li class="fragment appear">Whatever you think they are?</li>
<li class="fragment appear">It's probably less than that.</li>

</ul>

</section>
<section id="slide-org9a05d10">
<h4 id="org9a05d10">Like a lambda</h4>
<p>
Except
</p>
<ul>
<li class="fragment appear">The lambda is the return type</li>
<li class="fragment appear">They control when they suspend</li>
<li class="fragment appear">No stacks, threads, or fibers</li>

</ul>
</section>
<section id="slide-org8b4ad1b">
<h5 id="org8b4ad1b">Stackful vs Stackless</h5>
<ul>
<li class="fragment appear">"Stackless"</li>
<li class="fragment appear">Which means they execute on the regular stack.</li>
<li class="fragment appear">The architectural model is very different.</li>
<li class="fragment appear">If you don't know these terms - forget they exist.</li>
<li class="fragment appear">Coroutine == Resumable Stateful Function</li>

</ul>

</section>
<section id="slide-org453a2ea">
<h4 id="org453a2ea">If it co_awaits, it's a coroutine</h4>
<ul>
<li class="fragment appear"><code>co_await</code></li>
<li class="fragment appear"><code>co_yield</code>
<ul>
<li>is a co_await</li>

</ul></li>
<li class="fragment appear"><code>co_return</code>
<ul>
<li>is a very special co_await †</li>

</ul></li>

</ul>
</section>
<section id="slide-orga912b2d">
<h4 id="orga912b2d">A Coroutine's body</h4>
<div class="org-src-container">

<pre class="src src-c++">{
&#8195;&#8195;&#8195;promise-type promise{promise-constructor-arguments};
&#8195;&#8195;&#8195;<span class="org-keyword">try</span> {
&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;<span class="org-type">co_await</span> <span class="org-variable-name">promise</span>.initial_suspend() ;
&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;function-body
&#8195;&#8195;&#8195;} <span class="org-keyword">catch</span> ( <span class="org-function-name">...</span> ) {
&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;<span class="org-keyword">if</span> (<span class="org-negation-char">!</span>initial-await-resume-called)
&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;<span class="org-keyword">throw</span> ;
&#8195;&#8195;&#8195;&#8195;&#8195;&#8195;promise.unhandled_exception() ;
&#8195;&#8195;&#8195;}
<span class="org-keyword">final</span>-suspend :
&#8195;&#8195;&#8195;<span class="org-keyword">co_await</span> promise.final_suspend() ;
}
</pre>
</div>
</section>
<section id="slide-org6547810">
<h4 id="org6547810">Terms defined</h4>
<dl>
<dt>promise-type</dt><dd>determined by coroutine_traits&lt;&gt;, but usually a typedef in the return type.</dd>
<dt>promise-constructor-arguments</dt><dd>the parameters if there's a valid overload for promise-type that takes them, otherwise empty.</dd>
<dt>function-body</dt><dd>the body of the coroutine function.</dd>
<dt>initial-await-resume-called</dt><dd>was the await_resume of the initial suspend called. Did we start.</dd>
<dt>final-suspend</dt><dd>† target for <code>co_return</code> which calls either <code>return_value</code> or <code>return_void</code> first then executes <code>goto final-suspend</code>.</dd>

</dl>

</section>
<section id="slide-org11ecc90">
<h4 id="org11ecc90">Awaitable and Promise</h4>
<div class="outline-text-4" id="text-org11ecc90">
</div>
</section>
<section id="slide-org37ef28e">
<h5 id="org37ef28e">Awaitables are easy:</h5>
<dl>
<dt>bool await_ready()</dt><dd>proceed or suspend - false is suspend</dd>
<dt>await_suspend</dt><dd>called if await_ready is (contextually) false
<dl>
<dt>void await_suspend(coroutine_handle&lt;&gt; h)</dt><dd>call await_suspend and suspend</dd>
<dt>bool await_suspend(coroutine_handle&lt;&gt; h)</dt><dd>call await_suspend and resume if false</dd>
<dt>std​::​coroutine_handle&lt;Z&gt; await_suspend(coroutine_handle&lt;&gt; h)</dt><dd>call resume() on return</dd>

</dl></dd>
<dt>T await_resume()</dt><dd><p>
call when resume, T is the result of co_await
</p>

<p>
Awaitable interface is programmer facing.
</p></dd>

</dl>
</section>
<section id="slide-org0edf530">
<h5 id="org0edf530">Minimal Example</h5>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span> &lt;<span class="org-keyword">typename</span> <span class="org-type">T</span>&gt;
<span class="org-keyword">struct</span> <span class="org-type">awaitable</span> : <span class="org-keyword">public</span> <span class="org-constant">std</span>::<span class="org-type">suspend_always</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">constexpr bool await_ready() const noexcept { return false; } // from std::suspend always</span>
    <span class="org-keyword">constexpr</span> <span class="org-type">void</span> <span class="org-function-name">await_suspend</span>(<span class="org-type">coroutine_handle</span>&lt;&gt; <span class="org-variable-name">h</span>) <span class="org-keyword">const</span> <span class="org-keyword">noexcept</span> { h.resume(); }
    <span class="org-keyword">constexpr</span> <span class="org-type">T</span> <span class="org-function-name">await_resume</span>() <span class="org-keyword">const</span> <span class="org-keyword">noexcept</span> { <span class="org-keyword">return</span> T{}; }
};
</pre>
</div>
</section>
<section id="slide-orge3e6fa9">
<h5 id="orge3e6fa9">Promises are a little harder:</h5>
<dl>
<dt>ReturnType::promise_type</dt><dd>typedef for the promise</dd>
<dt>get_return_object()</dt><dd>the return type of the coroutine</dd>
<dt>(no term)</dt><dd>return_
<dl>
<dt>return_value()</dt><dd>return value or &#x2026;</dd>
<dt>return_void()</dt><dd>return void</dd>

</dl></dd>
<dt>initial_suspend()</dt><dd>initial suspend before body</dd>
<dt>final_suspend()</dt><dd>final suspend after body</dd>
<dt>unhandled_exception()</dt><dd>called if an exception escapes
Promises and coro return types are library writer facing.</dd>

</dl>
</section>
<section id="slide-org959cf12">
<h4 id="org959cf12">GCC's implementation is almost exactly lambda</h4>
<p>
There's an instance of an unnamable type that is tied to the particular coroutine frame. The type has a bit of state that indicates where the `jmp` to upon entry goes to. The coroutine function allocates one of these, and ties it to the return type via the promise.
</p>
</section>
