cppnow/convert-state-machine-coroutine-slides.org
*** Minimal Boring Coroutine
    #+begin_src c++
#include <coroutine>

struct MinimalCoro {
  struct promise_type {
    MinimalCoro get_return_object() {
      return {.h_ = std::coroutine_handle<promise_type>::from_promise(*this)};
    }
    std::suspend_always initial_suspend() noexcept { return {}; }
    std::suspend_always final_suspend() noexcept { return {}; }
    void                unhandled_exception() {}
  };

  std::coroutine_handle<promise_type> h_;
};

void before();
void after();

MinimalCoro func() {
  before();
  co_await std::suspend_always{};
  after();
}
    #+end_src
    #+begin_notes
    Cold Start - suspends initially
    Suspends at the co_await, which does nothing except yield
    Suspends after after()

    #+end_notes
    [[https://godbolt.org/#g:!((g:!((g:!((h:codeEditor,i:(fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:'%23include+%3Ccoroutine%3E%0A%0Astruct+MinimalCoro+%7B%0A++struct+promise_type+%7B%0A++++MinimalCoro+get_return_object()+%7B%0A++++++return+%7B%0A++++++++.h_+%3D+std::coroutine_handle%3Cpromise_type%3E::from_promise(*this)%0A++++++%7D%3B%0A++++%7D%0A++++std::suspend_always+initial_suspend()+noexcept+%7B+return+%7B%7D%3B+%7D%0A++++std::suspend_always+final_suspend()+noexcept+%7B+return+%7B%7D%3B+%7D%0A++++void+unhandled_exception()+%7B%7D%0A++%7D%3B%0A%0A++std::coroutine_handle%3Cpromise_type%3E+h_%3B%0A%7D%3B%0A%0Avoid+before()%3B%0Avoid+after()%3B%0A%0AMinimalCoro+func()+%0A%7B%0A++++before()%3B%0A++++co_await+std::suspend_always%7B%7D%3B%0A++++after()%3B%0A%7D%0A%0A'),l:'5',n:'0',o:'C%2B%2B+source+%231',t:'0')),k:33.333333333333336,l:'4',m:100,n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:g111,filters:(b:'0',binary:'1',commentOnly:'1',demangle:'0',directives:'0',execute:'1',intel:'0',libraryCode:'0',trim:'1'),fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,libs:!((name:cppcoro,ver:trunk)),options:'--std%3Dc%2B%2B20+-O3',selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1),l:'5',n:'0',o:'x86-64+gcc+11.1+(Editor+%231,+Compiler+%231)+C%2B%2B',t:'0')),header:(),k:46.61565626839317,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:output,i:(compiler:1,editor:1,fontScale:14,fontUsePx:'0',wrap:'1'),l:'5',n:'0',o:'%231+with+x86-64+gcc+11.1',t:'0')),k:20.051010398273487,l:'4',n:'0',o:'',s:0,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4][Compiler Explorer Link]]
* A bit of theory
** UML State Diagrams
   Describes a "finite automaton"

   Standardized as part of the Unified Modeling Lanaguage back in the last century.

*** Simple Activation
   #+begin_src plantuml :file simple1.png
@startuml
[*] --> ACTIVATED
ACTIVATED -> ACTIVATED : packet_received
ACTIVATED --> DEACTIVATED : deactivate
DEACTIVATED --> [*]
@enduml
#+end_src
The begin and end states correspond with object construction and destruction.
*** Substate
   #+begin_src plantuml :file substate1.png
@startuml

[*] --> off

state off {
  off --> blinking : turn_on_off
}

state blinking {
  [*] --> blink_on
  blinking --> off : turn_on_off

  state blink_on {
    blink_on --> blink_off : [1.5s]
    blink_on : enter/turn_led_on
    blink_on : exit/turn_led_off
  }

  state blink_off {
    blink_off --> blink_on : [0.75s]
  }
}
@enduml
    #+end_src
The blinking state has substates on and off.

enter/ and exit/ are actions that must occur entering and leaving a state.
*** Orthogonal Regions
    #+begin_src plantuml :file keyboard.png
@startuml
[*] --> Keyboard

state Keyboard {
  [*] -> NumLockOff
  NumLockOff --> NumLockOn : NumLock
  NumLockOff --> NumLockOff : Number_Key
  NumLockOn --> NumLockOff : NumLock
  NumLockOn --> NumLockOn : Number_Key
  ||
  [*] -> CapsLockOff
  CapsLockOff --> CapsLockOn : CapsLock
  CapsLockOn --> CapsLockOff : CapsLock
  CapsLockOff --> CapsLockOff : Any_Key
  CapsLockOn --> CapsLockOn : Any_Key
}

@enduml
    #+end_src
    Keyboard has the orthogonal states of NumLock and CapsLock.

** UML based on Harel State Charts
   A generalization of state machine diagrams more usable for human beings.

   Allows for grouping states with the same parameters together as the substate chart.

   Allows for history, returning to a state with the substate active when the superstate left.

   A full formal model.

** Model, not necessarily Code
   Modeling a system with a state machine isn't always how it is coded. The transitions, guards, and states may be easier to express in a different paradigm.

   But it is possible.


* The core coroutine transform is to a state machine
** The Transform
   C++ 20 coroutines are resumable functions.
   A coroutine is transformed into
   - a handle to the frame holding the stack variables.
   - an indicator of where to resume.
   - an instance comprising this particular execution.
** State is maintained in the coroutine frame
   The coroutine frame is equivalent to the member variables of an object.
** ~co_await~ points are the states
   The coroutine is waiting for input.
** Resumptions are transitions firing
   When a transition fires the coroutine can decide how to proceed to the next state.

* State machines are more than regexps
  Regular expressions are often, even usually, implemented as state machines.

  The state machine is built automatically.

  Very large state machines need tools to manage them.

  Most state machines are small.

* Most state machines are simple
** Golden Path, Error Path, Failure Path
   - Things go well
   - Things go badly in expected ways
     * Bad input
     * File Not Found
   - Things go badly in unexpected ways
     * 2 + 2 == 5
** Rule of 5 to 9 and resorting to state machine tools
   We can genererally hold 7 plus or minus 2 things in our heads.

   More than that and the structure in our head collapses.

   5 to 9 states can be maintained by hand.

   100s or 1000s can not.

** Generality might mean `goto`
   If states can be reached from any other state, the code might need a ~goto~.

   Forward or backward.

   It will not need to leave the scope of the machine / coroutine.

** Suspension and Decision
   Guarded transitions are just if tests after a suspension point.

