cppnow/convert-state-machine-coroutine-slides.html
<section id="slide-org6b49452">
<h4 id="org6b49452">Minimal Boring Coroutine</h4>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;coroutine&gt;</span>

<span class="org-keyword">struct</span> <span class="org-type">MinimalCoro</span> {
  <span class="org-keyword">struct</span> <span class="org-type">promise_type</span> {
    <span class="org-type">MinimalCoro</span> <span class="org-function-name">get_return_object</span>() {
      <span class="org-keyword">return</span> {.h_ = <span class="org-constant">std</span>::<span class="org-constant">coroutine_handle</span>&lt;<span class="org-type">promise_type</span>&gt;::from_promise(*<span class="org-keyword">this</span>)};
    }
    <span class="org-constant">std</span>::<span class="org-type">suspend_always</span> <span class="org-function-name">initial_suspend</span>() <span class="org-keyword">noexcept</span> { <span class="org-keyword">return</span> {}; }
    <span class="org-constant">std</span>::<span class="org-type">suspend_always</span> <span class="org-function-name">final_suspend</span>() <span class="org-keyword">noexcept</span> { <span class="org-keyword">return</span> {}; }
    <span class="org-type">void</span>                <span class="org-function-name">unhandled_exception</span>() {}
  };

  <span class="org-constant">std</span>::<span class="org-type">coroutine_handle</span>&lt;<span class="org-type">promise_type</span>&gt; <span class="org-variable-name">h_</span>;
};

<span class="org-type">void</span> <span class="org-function-name">before</span>();
<span class="org-type">void</span> <span class="org-function-name">after</span>();

<span class="org-type">MinimalCoro</span> <span class="org-function-name">func</span>() {
  before();
  <span class="org-type">co_await</span> <span class="org-constant">std</span>::<span class="org-variable-name">suspend_always</span>{};
  after();
}
</pre>
</div>
<aside class="notes">
<p>
Cold Start - suspends initially
Suspends at the co_await, which does nothing except yield
Suspends after after()
</p>

</aside>
<p>
<a href="https://godbolt.org/#g:!((g:!((g:!((h:codeEditor,i:(fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:'%23include+%3Ccoroutine%3E%0A%0Astruct+MinimalCoro+%7B%0A++struct+promise_type+%7B%0A++++MinimalCoro+get_return_object()+%7B%0A++++++return+%7B%0A++++++++.h_+%3D+std::coroutine_handle%3Cpromise_type%3E::from_promise(*this)%0A++++++%7D%3B%0A++++%7D%0A++++std::suspend_always+initial_suspend()+noexcept+%7B+return+%7B%7D%3B+%7D%0A++++std::suspend_always+final_suspend()+noexcept+%7B+return+%7B%7D%3B+%7D%0A++++void+unhandled_exception()+%7B%7D%0A++%7D%3B%0A%0A++std::coroutine_handle%3Cpromise_type%3E+h_%3B%0A%7D%3B%0A%0Avoid+before()%3B%0Avoid+after()%3B%0A%0AMinimalCoro+func()+%0A%7B%0A++++before()%3B%0A++++co_await+std::suspend_always%7B%7D%3B%0A++++after()%3B%0A%7D%0A%0A'),l:'5',n:'0',o:'C%2B%2B+source+%231',t:'0')),k:33.333333333333336,l:'4',m:100,n:'0',o:'',s:0,t:'0'),(g:!((h:compiler,i:(compiler:g111,filters:(b:'0',binary:'1',commentOnly:'1',demangle:'0',directives:'0',execute:'1',intel:'0',libraryCode:'0',trim:'1'),fontScale:14,fontUsePx:'0',j:1,lang:c%2B%2B,libs:!((name:cppcoro,ver:trunk)),options:'--std%3Dc%2B%2B20+-O3',selection:(endColumn:1,endLineNumber:1,positionColumn:1,positionLineNumber:1,selectionStartColumn:1,selectionStartLineNumber:1,startColumn:1,startLineNumber:1),source:1),l:'5',n:'0',o:'x86-64+gcc+11.1+(Editor+%231,+Compiler+%231)+C%2B%2B',t:'0')),header:(),k:46.61565626839317,l:'4',n:'0',o:'',s:0,t:'0'),(g:!((h:output,i:(compiler:1,editor:1,fontScale:14,fontUsePx:'0',wrap:'1'),l:'5',n:'0',o:'%231+with+x86-64+gcc+11.1',t:'0')),k:20.051010398273487,l:'4',n:'0',o:'',s:0,t:'0')),l:'2',n:'0',o:'',t:'0')),version:4">Compiler Explorer Link</a>
</p>
</section>
</section>
<section>
<section id="slide-org18dd46e">
<h2 id="org18dd46e">A bit of theory</h2>
<div class="outline-text-2" id="text-org18dd46e">
</div>
</section>
<section id="slide-orgae5aac6">
<h3 id="orgae5aac6">UML State Diagrams</h3>
<p>
Describes a "finite automaton"
</p>

<p>
Standardized as part of the Unified Modeling Lanaguage back in the last century.
</p>

</section>
<section id="slide-org3b76de7">
<h4 id="org3b76de7">Simple Activation</h4>
<div class="org-src-container">

<pre class="src src-plantuml">@startuml
[*] --&gt; ACTIVATED
ACTIVATED -&gt; ACTIVATED : packet_received
ACTIVATED --&gt; DEACTIVATED : deactivate
DEACTIVATED --&gt; [*]
@enduml
</pre>
</div>
<p>
The begin and end states correspond with object construction and destruction.
</p>
</section>
<section id="slide-orgb87c5a0">
<h4 id="orgb87c5a0">Substate</h4>
<div class="org-src-container">

<pre class="src src-plantuml">@startuml

[*] --&gt; off

state off {
  off --&gt; blinking : turn_on_off
}

state blinking {
  [*] --&gt; blink_on
  blinking --&gt; off : turn_on_off

  state blink_on {
    blink_on --&gt; blink_off : [1.5s]
    blink_on : enter/turn_led_on
    blink_on : exit/turn_led_off
  }

  state blink_off {
    blink_off --&gt; blink_on : [0.75s]
  }
}
@enduml
</pre>
</div>
<p>
The blinking state has substates on and off.
</p>

<p>
enter/ and exit/ are actions that must occur entering and leaving a state.
</p>
</section>
<section id="slide-org38cd58e">
<h4 id="org38cd58e">Orthogonal Regions</h4>
<div class="org-src-container">

<pre class="src src-plantuml">@startuml
[*] --&gt; Keyboard

state Keyboard {
  [*] -&gt; NumLockOff
  NumLockOff --&gt; NumLockOn : NumLock
  NumLockOff --&gt; NumLockOff : Number_Key
  NumLockOn --&gt; NumLockOff : NumLock
  NumLockOn --&gt; NumLockOn : Number_Key
  ||
  [*] -&gt; CapsLockOff
  CapsLockOff --&gt; CapsLockOn : CapsLock
  CapsLockOn --&gt; CapsLockOff : CapsLock
  CapsLockOff --&gt; CapsLockOff : Any_Key
  CapsLockOn --&gt; CapsLockOn : Any_Key
}

@enduml
</pre>
</div>
<p>
Keyboard has the orthogonal states of NumLock and CapsLock.
</p>

</section>
<section id="slide-orgd2d74dd">
<h3 id="orgd2d74dd">UML based on Harel State Charts</h3>
<p>
A generalization of state machine diagrams more usable for human beings.
</p>

<p>
Allows for grouping states with the same parameters together as the substate chart.
</p>

<p>
Allows for history, returning to a state with the substate active when the superstate left.
</p>

<p>
A full formal model.
</p>

</section>
<section id="slide-orgbaf2908">
<h3 id="orgbaf2908">Model, not necessarily Code</h3>
<p>
Modeling a system with a state machine isn't always how it is coded. The transitions, guards, and states may be easier to express in a different paradigm.
</p>

<p>
But it is possible.
</p>


</section>
</section>
<section>
<section id="slide-org478d2ee">
<h2 id="org478d2ee">The core coroutine transform is to a state machine</h2>
<div class="outline-text-2" id="text-org478d2ee">
</div>
</section>
<section id="slide-orgd3a9761">
<h3 id="orgd3a9761">The Transform</h3>
<p>
C++ 20 coroutines are resumable functions.
A coroutine is transformed into
</p>
<ul>
<li>a handle to the frame holding the stack variables.</li>
<li>an indicator of where to resume.</li>
<li>an instance comprising this particular execution.</li>

</ul>
</section>
<section id="slide-orge56deaa">
<h3 id="orge56deaa">State is maintained in the coroutine frame</h3>
<p>
The coroutine frame is equivalent to the member variables of an object.
</p>
</section>
<section id="slide-orge338c0f">
<h3 id="orge338c0f"><code>co_await</code> points are the states</h3>
<p>
The coroutine is waiting for input.
</p>
</section>
<section id="slide-org6f2eb5d">
<h3 id="org6f2eb5d">Resumptions are transitions firing</h3>
<p>
When a transition fires the coroutine can decide how to proceed to the next state.
</p>

</section>
</section>
<section>
<section id="slide-org8f6c643">
<h2 id="org8f6c643">State machines are more than regexps</h2>
<p>
Regular expressions are often, even usually, implemented as state machines.
</p>

<p>
The state machine is built automatically.
</p>

<p>
Very large state machines need tools to manage them.
</p>

<p>
Most state machines are small.
</p>

</section>
</section>
<section>
<section id="slide-orgd177510">
<h2 id="orgd177510">Most state machines are simple</h2>
<div class="outline-text-2" id="text-orgd177510">
</div>
</section>
<section id="slide-org054699e">
<h3 id="org054699e">Golden Path, Error Path, Failure Path</h3>
<ul>
<li>Things go well</li>
<li>Things go badly in expected ways
<ul>
<li>Bad input</li>
<li>File Not Found</li>

</ul></li>
<li>Things go badly in unexpected ways
<ul>
<li>2 + 2 == 5</li>

</ul></li>

</ul>
</section>
<section id="slide-org3fe22dd">
<h3 id="org3fe22dd">Rule of 5 to 9 and resorting to state machine tools</h3>
<p>
We can genererally hold 7 plus or minus 2 things in our heads.
</p>

<p>
More than that and the structure in our head collapses.
</p>

<p>
5 to 9 states can be maintained by hand.
</p>

<p>
100s or 1000s can not.
</p>

</section>
<section id="slide-org8d206c2">
<h3 id="org8d206c2">Generality might mean `goto`</h3>
<p>
If states can be reached from any other state, the code might need a <code>goto</code>.
</p>

<p>
Forward or backward.
</p>

<p>
It will not need to leave the scope of the machine / coroutine.
</p>

</section>
<section id="slide-org12dd4cf">
<h3 id="org12dd4cf">Suspension and Decision</h3>
<p>
Guarded transitions are just if tests after a suspension point.
</p>

</section>
</section>
