cppnow/convert-state-machine-coroutine-slides.org
* No std library solutions
  We don't have coroutine types in the standard.

  We hope to have some for C++23.
** Handcrafting types not wrong
   The machinery is available for a reason.

   These are tools for library writers.

   Not Standard Library writers.

** Influences standardization
   We want general and proven tools in the library.

   We get those by seeing what actually works.

** Will continue to work
   If the standard adopts some std::coro_state_machine it will not break yours.

   If the standard never adopts some std::coro_state_machine it will not break yours.

* Code: simple multistep async operations
  Not actual production code, but I have real code like this.
** Begin Example
  #+begin_src c++
class CreateUser {
    CreateUser(std::string id);
    // ....
};
  #+end_src
** Lookup user or create
   #+begin_src c++
Result CreateUser::findUser() {
    db::getUser(id, [](std::unique_ptr<User> user) {
        userCallback(user)
    });
    return CONTINUE;
}
void CreateUser::userCallback(std::unique_ptr<User> user) {
    user_ = std::move(user);
    resume_();
}
   #+end_src
** Validate request with "compliance"
   #+begin_src c++
Result CreateUser::okToCreate() {
    compliance::checkOK(
        user_, [](bool isOK) { complianceCallback(isOK) });
    return CONTINUE;
}
void CreateUser::complianceCallback(bool isOk) {
    isOK_ = isOK;
    resume_();
}
  #+end_src
** Broadcast Operation
   #+begin_src c++
Result CreateUser::broadcastNewUser() {
    if (isOK_) {
        queueBroadcast(*user_);
    }
    return CONTINUE;
}
   #+end_src
** Return status for request
   #+begin_src c++
Result CreateUser::endTransaction() { return DONE; }
   #+end_src
** CreateUser
   #+begin_src c++
class CreateUser {
    Result CreateUser::findUser();
    Result CreateUser::okToCreate();
    Result CreateUser::broadcastNewUser();
    Result CreateUser::endTransaction();

    void CreateUser::userCallback(std::unique_ptr<User> user);
    void CreateUser::complianceCallback(bool isOk);

    State state_;
  public:
    reenter() {
        switch (state_) {
          Initial:
          FindUser: {findUser(); break;}
            // etc
        }
    }
};
   #+end_src
** Natural non-async code is the inverse coroutine transform
   If this were all syncronous it would just be a sequence of calls.
** while not done
   Externally this is driven checking if the object said it was done, and if not, scheduling the next operation.

* Async Callbacks and Threads
** C Callback signature
   #+begin_src c++
void (*callback)(void* context, void* response, void* error);
void install(callback cb, void* context);

   #+end_src
   Typical generic C-ish call back interface.

   - You give the framework the context to give back to you,
   - it gives you the response you were waiting for
   - alternatively or additionally it tells you about any errors

** C++  Callback
   Often a type-erased callable, like std::function<>.

   Binding ~this~ and other parameters.

** Context: this pointer or coroutine frame -- Yes
   For a C++ mechanism, the ~this~ pointer is often the context, and you cast back to the known type.

** Whose thread is this anyway - rescheduling
   Callback driven frameworks never call you on the right thread.

   Often doing complex work could stall the network, or worse deadlock on other callbacks.

** Converting a callback to an Awaitable
   #+begin_src c++
void api_with_callback(std::string p, std::function<void(int result)> callback);

auto api_with_callback_awaitable(const std::string& parameter) {
    struct awaiter : {
        std::string parameter_;
        int         result_;

        awaiter(const std::string& parameter) : parameter_(parameter) {}

        bool await_ready() { return false; } // suspend always

        void await_suspend(std::coroutine_handle<> handle) {
            api_with_callback(parameter_, [this, handle](int result) {
                result_ = result;
                handle.resume();
            });
        }
        int await_resume() { return result_; }
    };
    return awaiter(parameter);
}
   #+end_src

** Rescheduling on the threadpool
   Not really magic.
   Provide an awaitable that resumes the handle inside the threadpool.
   #+begin_src c++
// FOR EXPOSITION ONLY
void thread_pool::await_suspend(coroutine_handle<> handle) {
    schedule(job([]() { handle.resume() }));
}
   #+end_src

* Coroutines are NOT async
