cppnow/convert-state-machine-coroutine-slides.html
<section>
<section id="slide-org6f84764">
<h2 id="org6f84764">No std library solutions</h2>
<p>
We don't have coroutine types in the standard.
</p>

<p>
We hope to have some for C++23.
</p>
</section>
<section id="slide-org4411f6e">
<h3 id="org4411f6e">Handcrafting types not wrong</h3>
<p>
The machinery is available for a reason.
</p>

<p>
These are tools for library writers.
</p>

<p>
Not Standard Library writers.
</p>

</section>
<section id="slide-org9df2ecf">
<h3 id="org9df2ecf">Influences standardization</h3>
<p>
We want general and proven tools in the library.
</p>

<p>
We get those by seeing what actually works.
</p>

</section>
<section id="slide-orgcbc1784">
<h3 id="orgcbc1784">Will continue to work</h3>
<p>
If the standard adopts some std::coro_state_machine it will not break yours.
</p>

<p>
If the standard never adopts some std::coro_state_machine it will not break yours.
</p>

</section>
</section>
<section>
<section id="slide-org67ec1f1">
<h2 id="org67ec1f1">Code: simple multistep async operations</h2>
<p>
Not actual production code, but I have real code like this.
</p>
</section>
<section id="slide-org006fff2">
<h3 id="org006fff2">Begin Example</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">CreateUser</span> {
    <span class="org-function-name">CreateUser</span>(<span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">id</span>);
    <span class="org-comment-delimiter">// </span><span class="org-comment">....</span>
};
</pre>
</div>
</section>
<section id="slide-org7e136c0">
<h3 id="org7e136c0">Lookup user or create</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">findUser</span>() {
    <span class="org-constant">db</span>::getUser(id, [](<span class="org-constant">std</span>::<span class="org-type">unique_ptr</span>&lt;User&gt; <span class="org-variable-name">user</span>) {
        userCallback(user)
    });
    <span class="org-keyword">return</span> CONTINUE;
}
<span class="org-type">void</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">userCallback</span>(<span class="org-constant">std</span>::<span class="org-type">unique_ptr</span>&lt;User&gt; <span class="org-variable-name">user</span>) {
    user_ = <span class="org-constant">std</span>::move(user);
    resume_();
}
</pre>
</div>
</section>
<section id="slide-orgfed2522">
<h3 id="orgfed2522">Validate request with "compliance"</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">okToCreate</span>() {
    <span class="org-constant">compliance</span>::checkOK(
        user_, [](<span class="org-type">bool</span> <span class="org-variable-name">isOK</span>) { complianceCallback(isOK) });
    <span class="org-keyword">return</span> CONTINUE;
}
<span class="org-type">void</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">complianceCallback</span>(<span class="org-type">bool</span> <span class="org-variable-name">isOk</span>) {
    isOK_ = isOK;
    resume_();
}
</pre>
</div>
</section>
<section id="slide-orgf92b76c">
<h3 id="orgf92b76c">Broadcast Operation</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">broadcastNewUser</span>() {
    <span class="org-keyword">if</span> (isOK_) {
        queueBroadcast(*user_);
    }
    <span class="org-keyword">return</span> CONTINUE;
}
</pre>
</div>
</section>
<section id="slide-org45c03a6">
<h3 id="org45c03a6">Return status for request</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">endTransaction</span>() { <span class="org-keyword">return</span> DONE; }
</pre>
</div>
</section>
<section id="slide-orgf136e4b">
<h3 id="orgf136e4b">CreateUser</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">CreateUser</span> {
    <span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">findUser</span>();
    <span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">okToCreate</span>();
    <span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">broadcastNewUser</span>();
    <span class="org-type">Result</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">endTransaction</span>();

    <span class="org-type">void</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">userCallback</span>(<span class="org-constant">std</span>::<span class="org-type">unique_ptr</span>&lt;User&gt; <span class="org-variable-name">user</span>);
    <span class="org-type">void</span> <span class="org-constant">CreateUser</span>::<span class="org-function-name">complianceCallback</span>(<span class="org-type">bool</span> <span class="org-variable-name">isOk</span>);
<span class="org-comment-delimiter">// </span><span class="org-comment">....</span>
    }
};
</pre>
</div>
</section>
<section id="slide-org33a2daf">
<h3 id="org33a2daf">Natural non-async code is the inverse coroutine transform</h3>
<p>
If this were all syncronous it would just be a sequence of calls.
</p>
</section>
<section id="slide-org8452873">
<h3 id="org8452873">while not done</h3>
<p>
Externally this is driven checking if the object said it was done, and if not, scheduling the next operation.
</p>

</section>
</section>
<section>
<section id="slide-org5c91c93">
<h2 id="org5c91c93">Async Callbacks and Threads</h2>
<div class="outline-text-2" id="text-org5c91c93">
</div>
</section>
<section id="slide-org764ca72">
<h3 id="org764ca72">C Callback signature</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> (*<span class="org-function-name">callback</span>)(<span class="org-type">void</span>* <span class="org-variable-name">context</span>, <span class="org-type">void</span>* <span class="org-variable-name">response</span>, <span class="org-type">void</span>* <span class="org-variable-name">error</span>);
<span class="org-type">void</span> <span class="org-function-name">install</span>(<span class="org-type">callback</span> <span class="org-variable-name">cb</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span>);

</pre>
</div>
<p>
Typical generic C-ish call back interface.
</p>

<ul>
<li>You give the framework the context to give back to you,</li>
<li>it gives you the response you were waiting for</li>
<li>alternatively or additionally it tells you about any errors</li>

</ul>

</section>
<section id="slide-org763e39f">
<h3 id="org763e39f">C++  Callback</h3>
<p>
Often a type-erased callable, like std::function&lt;&gt;.
</p>

<p>
Binding <code>this</code> and other parameters.
</p>

</section>
<section id="slide-org04a8e80">
<h3 id="org04a8e80">Context: this pointer or coroutine frame &#x2013; Yes</h3>
<p>
For a C++ mechanism, the <code>this</code> pointer is often the context, and you cast back to the known type.
</p>

</section>
<section id="slide-org6a55e75">
<h3 id="org6a55e75">Whose thread is this anyway - rescheduling</h3>
<p>
Callback driven frameworks never call you on the right thread.
</p>

<p>
Often doing complex work could stall the network, or worse deadlock on other callbacks.
</p>

</section>
<section id="slide-orgc0b299e">
<h3 id="orgc0b299e">Converting a callback to an Awaitable</h3>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">api_with_callback</span>(<span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">p</span>, <span class="org-constant">std</span>::<span class="org-type">function</span>&lt;<span class="org-type">void</span>(<span class="org-type">int</span> <span class="org-variable-name">result</span>)&gt; <span class="org-variable-name">callback</span>);

<span class="org-keyword">auto</span> <span class="org-function-name">api_with_callback_awaitable</span>(<span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">parameter</span>) {
    <span class="org-keyword">struct</span> <span class="org-type">awaiter</span> : {
        <span class="org-constant">std</span>::<span class="org-type">string</span> <span class="org-variable-name">parameter_</span>;
        <span class="org-type">int</span>         <span class="org-variable-name">result_</span>;

        <span class="org-function-name">awaiter</span>(<span class="org-keyword">const</span> <span class="org-constant">std</span>::<span class="org-type">string</span>&amp; <span class="org-variable-name">parameter</span>) : parameter_(parameter) {}

        <span class="org-type">bool</span> <span class="org-function-name">await_ready</span>() { <span class="org-keyword">return</span> <span class="org-constant">false</span>; } <span class="org-comment-delimiter">// </span><span class="org-comment">suspend always</span>

        <span class="org-type">void</span> <span class="org-function-name">await_suspend</span>(<span class="org-constant">std</span>::<span class="org-type">coroutine_handle</span>&lt;&gt; <span class="org-variable-name">handle</span>) {
            api_with_callback(parameter_, [<span class="org-keyword">this</span>, <span class="org-constant">handle</span>](<span class="org-type">int</span> <span class="org-variable-name">result</span>) {
                result_ = result;
                handle.resume();
            });
        }
        <span class="org-type">int</span> <span class="org-function-name">await_resume</span>() { <span class="org-keyword">return</span> result_; }
    };
    <span class="org-keyword">return</span> awaiter(parameter);
}
</pre>
</div>

</section>
<section id="slide-org905a102">
<h3 id="org905a102">Rescheduling on the threadpool</h3>
<p>
Not really magic.
Provide an awaitable that resumes the handle inside the threadpool.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-comment-delimiter">// </span><span class="org-comment">FOR EXPOSITION ONLY</span>
<span class="org-type">void</span> <span class="org-constant">thread_pool</span>::<span class="org-function-name">await_suspend</span>(<span class="org-type">coroutine_handle</span>&lt;&gt; <span class="org-variable-name">handle</span>) {
    schedule(job([]() { handle.resume() }));
}
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgedd8250">
<h2 id="orgedd8250">Coroutines are NOT async</h2>
<div class="outline-text-2" id="text-orgedd8250">
</div>
</section>
